/**
 * \mainpage
 * # Лабораторна робота №8
 *
 * \author Стась Артем:КН-922Б
 * \date 27-11-2022
 */
 /*!
\file main.c
\brief Головний файл
Це файл, який містить точку входу,
виклики функцій   lab05, lab06 та значення для аргументів цих функцій.
*/
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <malloc.h>
#include "lib.h"
/**
 Головна функція.
 
 Послідовність дій
- Присвоїти значення аргументам argc і argv.
\param argc - argc - аргумент типу int необхідний для обчислення чисел в масиві . 2
\param argv - масив типу char який зберігатиме в собі значення від якого почнеться перевірка всіх чисел .
- Створення змінних яким буде надано значення для аргументів функцій link lab05, lab06.
 Створення змінних яким буде надано значення для аргументів функцій link lab05, lab06.
t - зберігає значення за умовчуванням для функції lab06. Воно буде використовуватися якщо не будуть передані аргументи командного рядка.
c - змінна яка використовується для перевірки аргументів командного рядка.
Генеруємо рандомні числа за допомогою генератора rand() та функції srand(), після чого привласнюємо їх пріменним a .
• Потім викликаємо функцію lab05 і присвоюємо її аргументам значення примінних 
Функція lab05
 \param робимо перевірку на те, чи були введені аргументи через командний рядок.
 \return успішний код повернення з програми (0)
Функція lab06
 \param t - Число від якого розпочнеться перевірка квитків
 \return успішний код повернення з програми (0)
 */
int main(int argc, char *argv[]) 
{
    int a, i,b;
    long int  d[]= {24,342,345,234,545,678};
    long int  *t;
    unsigned int s = 6; 
    char *c;
    
    srand((unsigned int)time(NULL));
    a = rand() % 10;
    lab05(a);
    
    if(argc > 1)
    {
      s = 0;
      for(i = 1; i < argc; i++)
      {
      	s++;
      }
      
      
      t = (long int*) malloc (s * sizeof(long int));
      for(i = 1, b = 0; i < argc; i++, b++)
      {
      	 t[b] = strtol(argv[i], &c, 10);
      }
            
      lab06(t,s);
      
    }
    else
    {  
      lab06(d,s);     
    }
    
    return 0;
}
